<img src="http://iran-datascience.ir/SoheilTP/logo.jpg" />

<div class="alert alert-block alert-success">
    <h1 align="center">Machine Learning in Python</h1>
    <h3 align="center">Day 002: Pandas</h3>
    <h4 align="center"><a href="http://www.iran-machinelearning.ir">Soheil Tehranipour</a></h5>
</div>

> You can follow me in :
* [Linkedin](https://www.linkedin.com/in/soheiltehrani/). 
* [Instagram](https://www.instagram.com/soheiltehranipour/).
* [Github](https://github.com/soheiltehranipour).
* Website : www.iran-machinelearning.ir

<img src="https://s3-ap-south-1.amazonaws.com/av-blog-media/wp-content/uploads/2018/03/pandas-768x480.jpg" width="358" height="251" /> </p>

<div class="alert alert-block alert-success">
<p dir="rtl" style="text-align: center;"><span style="font-family: comic sans ms, sans-serif; font-size: 18pt;">آموزش کتابخانه Pandas با بررسی دیتاست Titanic</span></p>

</div>

In [5]:
import pandas as pd

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">pd.read_csv()</span></strong>
<p dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier;"><span style="font-size: 18pt;">نحوه خواندن فایل با فرمت csv توسط pandas</span><br /></span></strong></p>
</div>

In [8]:
titanic_data = pd.read_csv("titanic.csv")

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">head()</span></strong>
<p style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">نمایش ۵ داده اول ذخیره شده در دیتافریم</span></strong></p>
</div>
<p dir="rtl" style="text-align: right;"><strong><span style="font-family: courier new, courier;"><em>در صورت ثبت عدد به عنوان پارامتر ورودی، همان تعداد داده از index های ابتدایی دیتافریم را نمایش خواهد داد.</em></span></strong></p>

In [3]:
titanic_data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">shape</span></strong>
<p style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">مشاهده ابعاد (سطر و ستون) دیتافریم<br /></span></strong></p>
</div>

In [4]:
titanic_data.shape

(1309, 14)

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">Columns</span></strong>
<p style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">مشاهده عناوین ستون های دیتافریم<br /></span></strong></p>
</div>

In [5]:
titanic_data.columns

Index(['pclass', 'survived', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket',
       'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">dtypes</span></strong>
<p style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">مشاهده عناوین ستون ها و تایپ داده هایشان<br /></span></strong></p>
</div>

In [6]:
titanic_data.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">info()</span></strong>
<p style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">اطلاعات کاملتر در مورد داده ها<br /></span></strong></p>
<p dir="rtl" style="text-align: right;"><strong><span style="font-family: courier new, courier;"><em><span style="font-size: 12pt;">تعداد کل داده ها</span></em></span></strong></p>
<p dir="rtl" style="text-align: right;"><strong><span style="font-family: courier new, courier;"><em><span style="font-size: 12pt;">تمامی ستون ها به همراه تایپ داده هایشان</span></em></span></strong></p>
<p dir="rtl" style="text-align: right;"><strong><span style="font-family: courier new, courier;"><em><span style="font-size: 12pt;">هر ستون چه تعداد داده not-null دارد</span></em></span></strong></p>
</div>

In [7]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
pclass       1309 non-null int64
survived     1309 non-null int64
name         1309 non-null object
sex          1309 non-null object
age          1046 non-null float64
sibsp        1309 non-null int64
parch        1309 non-null int64
ticket       1309 non-null object
fare         1308 non-null float64
cabin        295 non-null object
embarked     1307 non-null object
boat         486 non-null object
body         121 non-null float64
home.dest    745 non-null object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.2+ KB

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><span style="font-family: courier new, courier;"><span style="font-size: 18pt;"><strong>انتخاب سطر و ستون های خاص</strong></span><span style="font-size: 18pt;"><br /></span></span></div>

In [8]:
titanic_data['survived'][0:5]

0    1
1    1
2    0
3    0
4    0
Name: survived, dtype: int64

In [9]:
titanic_data.survived[0:5]

0    1
1    1
2    0
3    0
4    0
Name: survived, dtype: int64

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier;"><span style="font-size: 18pt;">انتخاب ستون ها بر اساس چند عنوان مورد نظر</span><span style="font-size: 18pt;"><br /></span></span></strong></div>

In [10]:
titanic_data[['survived','age']][0:5]

   survived    age
0         1  29.00
1         1   0.92
2         0   2.00
3         0  30.00
4         0  25.00

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>value_counts</em>()</span></strong>
<p dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">پرینت داده های Unique در کل ستون<br /></span></strong></p>
</div>

In [11]:
titanic_data['survived'].value_counts()

0    809
1    500
Name: survived, dtype: int64

<div class="alert alert-block alert-success" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>از بین بازماندگان ۳۳۹ نفر <span style="text-decoration: underline;">زن</span> و تنها ۱۶۱ نفر <span style="text-decoration: underline;">مرد</span> بوده اند.<br /></em></span></strong></div>

In [12]:
titanic_data['survived'].value_counts(normalize=True) * 100

0    61.802903
1    38.197097
Name: survived, dtype: float64

<div class="alert alert-block alert-success" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>از بین بازماندگان ۳۳۹ نفر <span style="text-decoration: underline;">زن</span> و تنها ۱۶۱ نفر <span style="text-decoration: underline;">مرد</span> بوده اند.<br /></em></span></strong></div>

In [13]:
pd.crosstab( titanic_data.sex, titanic_data.survived )

survived    0    1
sex
female    127  339
male      682  161

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>نرمالایز نمودن داده ها بر اساس سطر<br /></em></span></strong></div>

In [14]:
pd.crosstab( titanic_data.sex, titanic_data.survived, normalize = "index" )

survived         0         1
sex
female    0.272532  0.727468
male      0.809015  0.190985

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><span style="font-family: comic sans ms, sans-serif; font-size: 18pt;"><strong><em><span style="font-family: courier new, courier;">نرمالایز نمودن داده ها بر اساس ستون</span></em><em><br /></em></strong></span></div>

In [15]:
pd.crosstab( titanic_data.sex, titanic_data.survived, normalize = "columns" )

survived         0      1
sex
female    0.156984  0.678
male      0.843016  0.322

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>نرمالایز نمودن کل داده ها<br /></em></span></strong></div>

In [16]:
pd.crosstab( titanic_data.sex, titanic_data.survived, normalize = "all" )

survived         0         1
sex
female    0.097021  0.258976
male      0.521008  0.122995

<div class="alert alert-block alert-info" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em> لیست کودکان زیر ۵ سال برای ارایه به خانواده بازماندگان</em></span></strong></div>

In [17]:
below_5_years = titanic_data[ titanic_data.age <= 5 ]

In [18]:
below_5_years[0:3]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
94,1,1,"Dodge, Master. Washington",male,4.00,0,2,33638,81.8583,A34,S,5,NaN,"San Francisco, CA"

<div class="alert alert-block alert-success" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>چه تعداد از مسافران کودک زیر ۵ سال بودند؟</em></span></strong></div>

In [19]:
len( below_5_years )

56

<div class="alert alert-block alert-success" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>&nbsp;۳۷ کودک از بین ۵۶ کودک زنده ماندند.<br /></em></span></strong></div>

In [1]:
titanic_data[ titanic_data.age <= 5 ]["survived"].value_counts( )

NameError: name 'titanic_data' is not defined

<div class="alert alert-block alert-success" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>نزدیک به ۲/۳ از کل کودکان زنده ماندند</em></span></strong></div>

In [21]:
titanic_data[ titanic_data.age <= 5 ]["survived"].value_counts( normalize = True )

1    0.660714
0    0.339286
Name: survived, dtype: float64

<div class="alert alert-block alert-info" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;"><em>از بین مسافرین، افراد با نام Allen را میخواهیم.</em></span></strong></div>

In [22]:
titanic_data[titanic_data.name.str.contains( "Allen") ]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
342,2,1,"Becker, Mrs. Allen Oliver (Nellie E Baumgardner)",female,36.0,0,3,230136,39.0000,F4,S,11,NaN,"Guntur, India / Benton Harbour, MI"
618,3,0,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,NaN,NaN,"Lower Clapton, Middlesex or Erdington, Birmingham"

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">unique()</span></strong>
<p style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">داده های منحصر به فرد در هر ستون<br /></span></strong></p>
</div>

In [23]:
titanic_data.embarked.unique()

array(['S', 'C', nan, 'Q'], dtype=object)

<div class="alert alert-block alert-success" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 14pt;"> بررسی تعداد داده ها با مقدار NaN در ستون Embarked - محل نجات یا غرق شدن افراد مشخص نباشد</span></strong></div>

In [24]:
titanic_data.embarked.value_counts(dropna=False)

S      914
C      270
Q      123
NaN      2
Name: embarked, dtype: int64

In [25]:
titanic_data.embarked.dropna().unique()

array(['S', 'C', 'Q'], dtype=object)

<div class="alert alert-block alert-info" dir="ltr" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">dropna()</span></strong>
<p style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 18pt;">حذف داده های بدون مقدار</span></strong></p>
</div>

In [26]:
clean_titanic_data = titanic_data.dropna()

In [27]:
len( clean_titanic_data )

0

<div class="alert alert-block alert-info" dir="rtl" style="text-align: center;"><strong><span style="font-size: 18pt; font-family: courier new, courier;">استراتژی های پیشنهادی کار با دستور dropna()</span></strong></div>

<div class="alert alert-block alert-info" dir="rtl" style="text-align: center;"><strong><span style="font-size: 18pt; font-family: courier new, courier;">حدف سطرهایی که در ستونشان NA&zwnj; دارند<br /></span></strong></div>

In [28]:
clean_titanic_data = titanic_data.dropna( how = "all" )
len( clean_titanic_data )

1309

<div class="alert alert-block alert-info" dir="rtl" style="text-align: center;"><strong><span style="font-size: 18pt; font-family: courier new, courier;">حدف سطرهایی که در برخی از ستون هایشان NA&zwnj; دارند<br /></span></strong></div>

In [52]:
clean_titanic_data = titanic_data.dropna( subset = ['age','pclass'], how = 'any' )
len( clean_titanic_data )

1046

<div class="alert alert-block alert-info" dir="rtl" style="text-align: center;"><strong><span style="font-size: 18pt; font-family: courier new, courier;">نحوه تغییر نام یک ستون<br /></span></strong></div>

In [32]:
titanic_data.head( 2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"

In [33]:
new_titanic = titanic_data.rename( columns = { 'row.names': 'rownum' },
                  inplace = True  )

In [34]:
titanic_data.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"

<div class="alert alert-block alert-success" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 14pt;">پرینت اطلاعات مربوط به جنسیت و سن و Pclass افرادی که زنده ماندند.<br /></span></strong></div>

In [39]:
titanic_data[ ( titanic_data.survived == 1 ) &
           ( titanic_data.age <= 5 ) ][['age',
                                        'sex',
                                        'pclass']][0:5]

      age     sex  pclass
1    0.92    male       1
94   4.00    male       1
339  1.00    male       2
340  4.00  female       2
359  0.83    male       2

<div class="alert alert-block alert-success" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 14pt;">پرینت اطلاعات مربوط به جنسیت و Pclass افرادی که زنده ماندند و سن آن ها مشخص نبوده است.<br /></span></strong></div>

In [40]:
titanic_data[ titanic_data.age.isnull() ][['age',
                                         'survived',
                                         'sex',
                                         'pclass']][0:5]

    age  survived     sex  pclass
15  NaN         0    male       1
37  NaN         1    male       1
40  NaN         0    male       1
46  NaN         0    male       1
59  NaN         1  female       1

<div class="alert alert-block alert-success" dir="rtl" style="text-align: center;"><strong><span style="font-family: courier new, courier; font-size: 14pt;">پرینت اطلاعات مربوط به جنسیت و Pclass افرادی که زنده ماندند و سن آن ها مشخص  است.<br /></span></strong></div>

In [41]:
titanic_data[ -titanic_data.age.isnull() ][['age',
                                          'survived',
                                          'sex',
                                          'pclass']][0:5]

     age  survived     sex  pclass
0  29.00         1  female       1
1   0.92         1    male       1
2   2.00         0  female       1
3  30.00         0    male       1
4  25.00         0  female       1

<div class="alert alert-block alert-info" dir="rtl" style="text-align: center;"><strong><span style="font-size: 18pt; font-family: courier new, courier;">نحوه ادغام و گروه بندی ستون های مختلف<br /></span></strong></div>

In [44]:
titanic_data.groupby( 'pclass' )['age'].mean()

pclass
1    39.159930
2    29.506705
3    24.816367
Name: age, dtype: float64

In [45]:
pclass_age_mean_df = titanic_data.groupby( 'pclass' )['age'].mean().reset_index()
pclass_age_mean_df

   pclass        age
0       1  39.159930
1       2  29.506705
2       3  24.816367

In [46]:
pclass_gender_age_mean_df = titanic_data.groupby( ['pclass', 'sex'] )['age'].mean().reset_index()
pclass_gender_age_mean_df

   pclass     sex        age
0       1  female  37.037594
1       1    male  41.029272
2       2  female  27.499223
3       2    male  30.815380
4       3  female  22.185329
5       3    male  25.962264

In [47]:
pclass_gender_survival_count_df = titanic_data.groupby( ['pclass', 'sex'] )['survived'].sum().reset_index()
pclass_gender_survival_count_df

   pclass     sex  survived
0       1  female       139
1       1    male        61
2       2  female        94
3       2    male        25
4       3  female       106
5       3    male        75

In [48]:
pclass_age_gender_survival_df = pclass_gender_age_mean_df.merge(
  pclass_gender_survival_count_df, on = ['pclass', 'sex'])

In [49]:
pclass_age_gender_survival_df

   pclass     sex        age  survived
0       1  female  37.037594       139
1       1    male  41.029272        61
2       2  female  27.499223        94
3       2    male  30.815380        25
4       3  female  22.185329       106
5       3    male  25.962264        75

<div class="alert alert-block alert-info" dir="rtl" style="text-align: center;"><strong><span style="font-size: 18pt; font-family: courier new, courier;">نحوه مربت سازی داده های دیتافریم<br /></span></strong></div>

In [50]:
pclass_age_gender_survival_df.sort_values( 'survived')

   pclass     sex        age  survived
3       2    male  30.815380        25
1       1    male  41.029272        61
5       3    male  25.962264        75
2       2  female  27.499223        94
4       3  female  22.185329       106
0       1  female  37.037594       139

In [51]:
pclass_age_gender_survival_df.sort_values( 'survived', ascending = False)

   pclass     sex        age  survived
0       1  female  37.037594       139
4       3  female  22.185329       106
2       2  female  27.499223        94
5       3    male  25.962264        75
1       1    male  41.029272        61
3       2    male  30.815380        25

<img style="float: left;" src="https://s3-ap-south-1.amazonaws.com/av-blog-media/wp-content/uploads/2018/03/pandas-768x480.jpg" width="178" height="111" /> </p>